# SetAllStyleParams

```pascal
PROCEDURE SetAllStyleParams(
				hStyle    : HANDLE;
				styleType : INTEGER);
```

```python
def vs.SetAllStyleParams(hStyle, styleType):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hStyle|HANDLE|Handle to a symbol definition contain a plug-in style|
|styleType|INTEGER|0 = Set all parameters to be ny istance parameters 1 = Set all parameters to be by stuyle parameters|

## Version
Availability: from Vectorworks 2017

## Category
* Objects - Custom